"""
Задание в группах: Создать телефонный справочник с возможностью импорта и экспорта данных в нескольких форматах.
Адресная книга должна выполнять следующие действия:
1. Добавить контакт
2. Отобразить контакты
3. Поиск контакта (по имени)
4. Удалить контакт
5. Сохранить контакты в .txt
6. Экспортировать в .csv

Думаю, что нужно сделать такие методы. Осталось подумать, какая должна быть структура.

add_contact
view_contacts
search_contact
delete_contact
save_contacts_txt
save_contacts_csv
"""


contacts =

def add_contacts(contact: dict):




