"""
Создайте программу для игры с конфетами человек против человека.
Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга.
Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет.
Все конфеты оппонента достаются сделавшему последний ход.
Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?

a) Добавьте игру против бота
b) Подумайте как наделить бота ""интеллектом""
"""


from random import randint


print('Привет! Это игра "2021 Конфета".'
      'Правила игры:'
      '1) На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга.'
      '2) Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет.'
      '3) Все конфеты оппонента достаются сделавшему последний ход.'
      'Кто забрал все конфеты, тот выиграл!')

# answer = input('Начнем? :) Введите "да" или "нет"')
# if answer.lower() == 'да':
#
#
# elif answer.lower() == 'нет':
#     print('Возвращайся в игру позже! :)')
#
# else:
#     print('Нужно ввести "да" или "нет"')


def pla
